---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairRiserDoesntIntersectBoundary
source: html/35098486-be50-3016-a6e5-ccb328e940ea.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairRiserDoesntIntersectBoundary Property

The line representing the top of a riser does not intersect one or both of the boundary lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairRiserDoesntIntersectBoundary { get; }
```